app/controllers/pokemon_controller.rb

INSERT INTO "pokemons" ("attack", "created_at", "defense", "image_url", "moves", "name", "poke_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@pokemon = Pokemon.new(pokemon_params)

		if @pokemon.save

SELECT "pokemons".* FROM "pokemons"
---
  def index
		@pokemon = Pokemon.all

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "pokemons" SET "defense" = $1, "moves" = $2, "updated_at" = $3 WHERE "pokemons"."id" = 1  [["defense", 6099], ["moves", "---\n- scratch\n- bite\n- slash\n"], ["updated_at", "2015-03-02 22:50:07.604309"]]
---
	def update
		@pokemon = Pokemon.find(params[:id])

		if @pokemon.update(pokemon_params)